name: "waveglow-trt"
platform: "tensorrt_plan"
default_model_filename: "waveglow_fp16.engine"

<<<<<<< HEAD
max_batch_size: 1
=======
max_batch_size: 0
>>>>>>> repo1

input {
  name: "mel"
  data_type: TYPE_FP16
<<<<<<< HEAD
  dims: [80, -1, 1]
=======
  dims: [1, 80, -1]
>>>>>>> repo1
}
input {
  name: "z"
  data_type: TYPE_FP16
<<<<<<< HEAD
  dims: [8, -1, 1]
=======
  dims: [1, 8, -1]
>>>>>>> repo1
}
output {
  name: "audio"
  data_type: TYPE_FP16
<<<<<<< HEAD
  dims: [-1]
=======
  dims: [1, -1]
>>>>>>> repo1
}
